playwright/artillery/scenarios/applications-flow.yml
# Applications Flow Load Test Scenario
# Tests the full applications CRUD flow under load
# This is a more complex scenario that navigates through multiple pages

config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3003' }}"
  phases:
    - duration: 60
      arrivalRate: 3
      name: "Warm up"
    - duration: 300
      arrivalRate: 5
      name: "Sustained load"
    - duration: 60
      arrivalRate: 0
      name: "Cool down"
  engines:
    playwright: {}
  processor: "../processors/applications-processor.js"
  variables:
    baseUrl: "{{ $processEnvironment.BASE_URL || 'http://localhost:3003' }}"

scenarios:
  - name: "Applications Flow Test"
    weight: 100
    flow:
      # Load homepage
      - function: "loadHomepage"
      - think: 1
      # Navigate to applications
      - function: "navigateToApplications"
      - think: 2
      # View applications list
      - function: "viewApplicationsList"
      - think: 3
      # Note: Creating/deleting applications in load tests may cause data conflicts
      # Consider using read-only operations or test data cleanup