playwright/artillery/scenarios/homepage-load.yml
# Homepage Load Test Scenario
# Tests the homepage under load with Core Web Vitals tracking

config:
  target: "http://localhost:3003"  # Default, overridden by environment config
  phases:
    # arrivalRate for warm-up is set by environment config (dev: 5, test: 4, prod: 3)
    - duration: 60
      name: "Warm up"
    - duration: 300
      arrivalRate: 10
      name: "Sustained load"
    - duration: 60
      arrivalRate: 0
      name: "Cool down"
  engines:
    playwright: {}
  processor: "../processors/homepage-processor.js"
  variables:
    baseUrl: "http://localhost:3003"  # Default, overridden by --variable flag

scenarios:
  - name: "Homepage Load Test"
    weight: 100
    flow:
      # Load homepage and track Core Web Vitals
      - function: "loadHomepage"
      # Simulate user think time
      - think: 2
      # Optional: Navigate to another page
      # - function: "navigateToApplications"
      # - think: 3